{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 500], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "keras_nlp>TokenAndPositionEmbedding", "config": {"name": "token_and_position_embedding", "trainable": true, "dtype": "float32", "vocabulary_size": 20000, "sequence_length": 500, "embedding_dim": 64, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "tie_weights": true, "mask_zero": false}, "name": "token_and_position_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 500], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "keras_nlp>TransformerEncoder", "config": {"name": "transformer_encoder", "trainable": true, "dtype": "float32", "intermediate_dim": 64, "num_heads": 2, "dropout": 0.2, "activation": "gelu", "layer_norm_epsilon": 1e-05, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "normalize_first": false}, "name": "transformer_encoder", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 500, 64], "dtype": "float32", "keras_history": ["token_and_position_embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling1d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 500, 64], "dtype": "float32", "keras_history": ["transformer_encoder", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["global_average_pooling1d", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dropout_1", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"name": "sparse_categorical_crossentropy", "reduction": "sum_over_batch_size", "from_logits": true, "ignore_class": null}}, "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dense/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "dense/bias", "shape": [5], "dtype": "float32"}, {"name": "token_and_position_embedding/token_embedding/embeddings", "shape": [20000, 64], "dtype": "float32"}, {"name": "token_and_position_embedding/position_embedding/embeddings", "shape": [500, 64], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/query/kernel", "shape": [64, 2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/query/bias", "shape": [2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/key/kernel", "shape": [64, 2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/key/bias", "shape": [2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/value/kernel", "shape": [64, 2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/value/bias", "shape": [2, 32], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/attention_output/kernel", "shape": [2, 32, 64], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer/attention_output/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/self_attention_layer_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_layer_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_layer_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_intermediate_dense/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_intermediate_dense/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_output_dense/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "transformer_encoder/feedforward_output_dense/bias", "shape": [64], "dtype": "float32"}]}]}